# Documentation: https://github.com/driesvints/dotfiles/blob/master/Brewfile

# Taps
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/versions"

# Binaries & Development
brew "autoconf" # Automatic configure script builder
brew "automake" # Tool for generating GNU Standards-compliant Makefiles
brew "bash-completion" # Programmable completion for Bash 3.2
brew "cloog", link: false # Generate code for scanning Z-polyhedra
brew "elasticsearch" # Distributed search & analytics engine
brew "jpeg" # Image manipulation library
brew "libpng" # Library for manipulating PNG images
brew "libtiff" # TIFF library and utilities
brew "wxmac" # Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "erlang" # Programming language for highly scalable real-time systems
brew "elixir" # Functional metaprogramming aware language built on Erlang VM
brew "exercism" # Command-line tool to interact with exercism.io
brew "gcc@4.9" # The GNU Compiler Collection
brew "gdbm" # GNU database manager
brew "git" # Distributed revision control system
brew "gradle" # Open-source build automation tool based on the Groovy and Kotlin DSL
brew "libtool" # Generic library support script
brew "graphviz" # Graph visualization software from AT&T and Bell Labs
brew "hub" # Add GitHub support to git on the command-line
brew "libgpg-error" # Common error values for all GnuPG components
brew "libksba" # X.509 and CMS library
brew "libogg" # Ogg Bitstream Library
brew "libvorbis" # Vorbis General Audio Compression Codec
brew "libyaml" # YAML Parser
brew "maven" # Java-based project management
brew "mysql" # Open source relational database management system
brew "nodenv" # Manage multiple NodeJS versions
brew "readline" # Library for command-line editing
brew "postgresql" # Object-relational database system
brew "sqlite" # Command-line interface for SQLite
brew "python" # Interpreted, interactive, object-oriented programming language
brew "sdl2" # Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "tree" # Display directories as trees (with optional color/HTML output)

# Applications
cask "caskroom/cask/diffmerge"
cask "caskroom/cask/java"
cask 'spectacle'
cask 'evernote'
cask 'alfred'
cask 'iterm2'
